; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-25)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 )
(:init
(arm-empty)
(on b1 b3)
(on b2 b23)
(on-table b3)
(on b4 b19)
(on b5 b14)
(on-table b6)
(on b7 b22)
(on b8 b20)
(on b9 b15)
(on-table b10)
(on b11 b10)
(on-table b12)
(on-table b13)
(on b14 b6)
(on b15 b16)
(on b16 b2)
(on b17 b11)
(on b18 b17)
(on b19 b25)
(on-table b20)
(on b21 b9)
(on b22 b4)
(on b23 b18)
(on b24 b8)
(on-table b25)
(clear b1)
(clear b5)
(clear b7)
(clear b12)
(clear b13)
(clear b21)
(clear b24)
)
(:goal
(and
(on b1 b7)
(on b2 b21)
(on b3 b10)
(on b4 b23)
(on b5 b6)
(on b6 b9)
(on b7 b15)
(on b8 b16)
(on b9 b2)
(on b10 b19)
(on b11 b22)
(on b12 b14)
(on b13 b8)
(on b15 b24)
(on b18 b17)
(on b19 b1)
(on b20 b12)
(on b21 b18)
(on b22 b25)
(on b23 b11)
(on b24 b20)
(on b25 b5))
)
)

; plan
1. (unstack b1 b3)
   deleted: (on b1 b3) (clear b1) (arm-empty)
   added: (holding b1) (clear b3)
   goals met: 1 of 22
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 22
3. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 1 of 22
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 22
5. (unstack b14 b6)
   deleted: (on b14 b6) (clear b14) (arm-empty)
   added: (holding b14) (clear b6)
   goals met: 1 of 22
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 22
7. (unstack b21 b9)
   deleted: (on b21 b9) (clear b21) (arm-empty)
   added: (holding b21) (clear b9)
   goals met: 1 of 22
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 22
9. (unstack b9 b15)
   deleted: (on b9 b15) (clear b9) (arm-empty)
   added: (holding b9) (clear b15)
   goals met: 1 of 22
10. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 22
11. (unstack b15 b16)
   deleted: (on b15 b16) (clear b15) (arm-empty)
   added: (holding b15) (clear b16)
   goals met: 1 of 22
12. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 22
13. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 1 of 22
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 22
15. (unstack b2 b23)
   deleted: (on b2 b23) (clear b2) (arm-empty)
   added: (holding b2) (clear b23)
   goals met: 1 of 22
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 22
17. (unstack b23 b18)
   deleted: (on b23 b18) (clear b23) (arm-empty)
   added: (holding b23) (clear b18)
   goals met: 1 of 22
18. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 1 of 22
19. (unstack b18 b17)
   deleted: (on b18 b17) (clear b18) (arm-empty)
   added: (holding b18) (clear b17)
   goals met: 0 of 22
20. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 22
21. (unstack b17 b11)
   deleted: (on b17 b11) (clear b17) (arm-empty)
   added: (holding b17) (clear b11)
   goals met: 0 of 22
22. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 22
23. (unstack b11 b10)
   deleted: (on b11 b10) (clear b11) (arm-empty)
   added: (holding b11) (clear b10)
   goals met: 0 of 22
24. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 22
25. (unstack b24 b8)
   deleted: (on b24 b8) (clear b24) (arm-empty)
   added: (holding b24) (clear b8)
   goals met: 0 of 22
26. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 22
27. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 0 of 22
28. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 22
29. (unstack b7 b22)
   deleted: (on b7 b22) (clear b7) (arm-empty)
   added: (holding b7) (clear b22)
   goals met: 0 of 22
30. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 22
31. (unstack b22 b4)
   deleted: (on b22 b4) (clear b22) (arm-empty)
   added: (holding b22) (clear b4)
   goals met: 0 of 22
32. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 22
33. (unstack b4 b19)
   deleted: (on b4 b19) (clear b4) (arm-empty)
   added: (holding b4) (clear b19)
   goals met: 0 of 22
34. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 22
35. (unstack b19 b25)
   deleted: (on b19 b25) (clear b19) (arm-empty)
   added: (holding b19) (clear b25)
   goals met: 0 of 22
36. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 22
37. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 0 of 22
38. (stack b8 b16)
   deleted: (clear b16) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b16)
   goals met: 1 of 22
39. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 1 of 22
40. (stack b13 b8)
   deleted: (clear b8) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b8)
   goals met: 2 of 22
41. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 2 of 22
42. (stack b18 b17)
   deleted: (clear b17) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b17)
   goals met: 3 of 22
43. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 3 of 22
44. (stack b21 b18)
   deleted: (clear b18) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b18)
   goals met: 4 of 22
45. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 22
46. (stack b2 b21)
   deleted: (clear b21) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b21)
   goals met: 5 of 22
47. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 5 of 22
48. (stack b9 b2)
   deleted: (clear b2) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b2)
   goals met: 6 of 22
49. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 22
50. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 7 of 22
51. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 7 of 22
52. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 8 of 22
53. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 8 of 22
54. (stack b25 b5)
   deleted: (clear b5) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b5)
   goals met: 9 of 22
55. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 9 of 22
56. (stack b22 b25)
   deleted: (clear b25) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b25)
   goals met: 10 of 22
57. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 10 of 22
58. (stack b11 b22)
   deleted: (clear b22) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b22)
   goals met: 11 of 22
59. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 11 of 22
60. (stack b23 b11)
   deleted: (clear b11) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b11)
   goals met: 12 of 22
61. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 12 of 22
62. (stack b4 b23)
   deleted: (clear b23) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b23)
   goals met: 13 of 22
63. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 13 of 22
64. (stack b12 b14)
   deleted: (clear b14) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b14)
   goals met: 14 of 22
65. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 14 of 22
66. (stack b20 b12)
   deleted: (clear b12) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b12)
   goals met: 15 of 22
67. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 15 of 22
68. (stack b24 b20)
   deleted: (clear b20) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b20)
   goals met: 16 of 22
69. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 16 of 22
70. (stack b15 b24)
   deleted: (clear b24) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b24)
   goals met: 17 of 22
71. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 17 of 22
72. (stack b7 b15)
   deleted: (clear b15) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b15)
   goals met: 18 of 22
73. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 18 of 22
74. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 19 of 22
75. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 19 of 22
76. (stack b19 b1)
   deleted: (clear b1) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b1)
   goals met: 20 of 22
77. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 20 of 22
78. (stack b10 b19)
   deleted: (clear b19) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b19)
   goals met: 21 of 22
79. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 21 of 22
80. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 22 of 22
